In [13]:
import pandas as pd

In [14]:
df=pd.read_excel('D:\DATASETS\Students.xlsx')

# SQL Sytnax 

##  Select * from Students

In [15]:
df

  first_name last_name country  age         topice  grads
0   Mustapha    Othman     EGY   34   Data Science  17.50
1     Omaima  Abdullah     KSA   28  Data Analysis  20.00
2     Siddik    Burhan     ESP   45  Data Analysis  19.00
3      Ahmed    Radwan     PSE   32   Data Enginer  14.25
4     Mariem     Mazen     EGY   18   Data Science  20.00
5   Mustapha     Jalal     MAR   36  Data Analysis  12.50

# SQL Sytnax 
## Select first_name from Students

In [58]:
df['first_name']

0    Mustapha
1      Omaima
2      Siddik
3       Ahmed
4      Mariem
5    Mustapha
Name: first_name, dtype: object

# SQL Sytnax 
## Select * from Students where contry="EYG"

In [59]:
df["country"]=="EGY"

0     True
1    False
2    False
3    False
4     True
5    False
Name: country, dtype: bool

In [60]:
df[df["country"]=="EGY"]

  first_name last_name country  age        topice  grads
0   Mustapha    Othman     EGY   34  Data Science   17.5
4     Mariem     Mazen     EGY   18  Data Science   20.0

# SQL Sytnax 
## Select  *	 from Students where first_name	LIKE ' M%'

In [61]:
df[df['first_name'].str.startswith('M')]

  first_name last_name country  age         topice  grads
0   Mustapha    Othman     EGY   34   Data Science   17.5
4     Mariem     Mazen     EGY   18   Data Science   20.0
5   Mustapha     Jalal     MAR   36  Data Analysis   12.5

# SQL Sytnax 
## Select * from Students where age Btwineen '17' and '30'

In [62]:
df[(df['age'] >=17) & (df['age']<=30)]

  first_name last_name country  age         topice  grads
1     Omaima  Abdullah     KSA   28  Data Analysis   20.0
4     Mariem     Mazen     EGY   18   Data Science   20.0

# SQL Sytnax 
## Select * from Students where Topice in  'Data Science' ,' Data Analysis'

In [63]:
df[df.topice  != 'Data Enginer']

  first_name last_name country  age         topice  grads
0   Mustapha    Othman     EGY   34   Data Science   17.5
1     Omaima  Abdullah     KSA   28  Data Analysis   20.0
2     Siddik    Burhan     ESP   45  Data Analysis   19.0
4     Mariem     Mazen     EGY   18   Data Science   20.0
5   Mustapha     Jalal     MAR   36  Data Analysis   12.5

# SQL Sytnax 
## Select * from Students order by 'grids' DESC

In [64]:
######## df['grads'].sort_values()

# SQL Sytnax 
## Select Distanct Topics  from Students

In [65]:
df['topice'].unique()

array(['Data Science', 'Data Analysis', 'Data Enginer'], dtype=object)

In [66]:
df['topice'].value_counts()

Data Analysis    3
Data Science     2
Data Enginer     1
Name: topice, dtype: int64